from datetime import datetime, timedelta

# 定義標題選項
payment_method_choices = {
    'Bank Transfer': '銀行轉帳',
    'FPS': '轉數快轉帳(FPS)',
}

payment_month_choices = {
    '1月份': '1月份',
    '2月份': '2月份',
    '3月份': '3月份',
    '4月份': '4月份',
    '5月份': '5月份',
    '6月份': '6月份',
    '7月份': '7月份',
    '8月份': '8月份',
    '9月份': '9月份',
    '10月份': '10月份',
    '11月份': '11月份',
    '12月份': '12月份',
}

payment_year_choices = {
    '2024': '2024',
    '2025': '2025',
    '2026': '2026',
    '2027': '2027',
    '2028': '2028',
    '2029': '2029',
    '2030': '2030',
    '2031': '2031',
    '2032': '2032',
    '2033': '2033',
    '2034': '2034',
}